test/load_test/loadTestingResults.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./test/load_test/create_banner.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 40s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 10s over 1 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     data_received..................: 488 kB 49 kB/s
     data_sent......................: 1.4 MB 135 kB/s
     http_req_blocked...............: avg=5.78µs  min=1µs    med=3µs     max=1.55ms   p(90)=5µs     p(95)=6µs    
     http_req_connecting............: avg=1.46µs  min=0s     med=0s      max=816µs    p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=24.56ms min=3.92ms med=19.08ms max=210.11ms p(90)=46.11ms p(95)=56.32ms
       { expected_response:true }...: avg=24.56ms min=3.92ms med=19.08ms max=210.11ms p(90)=46.11ms p(95)=56.32ms
     http_req_failed................: 0.00%  ✓ 0          ✗ 6098
     http_req_receiving.............: avg=43.45µs min=13µs   med=40µs    max=4.23ms   p(90)=62µs    p(95)=77.14µs
     http_req_sending...............: avg=23.78µs min=8µs    med=21µs    max=2.42ms   p(90)=30µs    p(95)=38µs   
     http_req_tls_handshaking.......: avg=0s      min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=24.49ms min=3.86ms med=19.02ms max=210.05ms p(90)=46.05ms p(95)=56.26ms
     http_reqs......................: 6098   606.635426/s
     iteration_duration.............: avg=24.69ms min=4ms    med=19.2ms  max=210.24ms p(90)=46.23ms p(95)=56.44ms
     iterations.....................: 6098   606.635426/s
     vus............................: 29     min=3        max=29
     vus_max........................: 30     min=30       max=30



          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./test/load_test/get_banner.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 32s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 2s over 1 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     data_received..................: 1.4 MB 718 kB/s
     data_sent......................: 1.3 MB 663 kB/s
     http_req_blocked...............: avg=3.78µs  min=1µs   med=2µs    max=1.16ms  p(90)=3µs    p(95)=4µs   
     http_req_connecting............: avg=945ns   min=0s    med=0s     max=938µs   p(90)=0s     p(95)=0s    
     http_req_duration..............: avg=3.06ms  min=652µs med=2.51ms max=38.79ms p(90)=4.97ms p(95)=6.53ms
       { expected_response:true }...: avg=3.06ms  min=652µs med=2.51ms max=38.79ms p(90)=4.97ms p(95)=6.53ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 9552
     http_req_receiving.............: avg=32.25µs min=12µs  med=25µs   max=1.11ms  p(90)=46µs   p(95)=61µs  
     http_req_sending...............: avg=11.68µs min=4µs   med=9µs    max=4.81ms  p(90)=15µs   p(95)=20µs  
     http_req_tls_handshaking.......: avg=0s      min=0s    med=0s     max=0s      p(90)=0s     p(95)=0s    
     http_req_waiting...............: avg=3.02ms  min=604µs med=2.47ms max=38.71ms p(90)=4.92ms p(95)=6.48ms
     http_reqs......................: 9552   4756.585994/s
     iteration_duration.............: avg=3.14ms  min=727µs med=2.59ms max=38.9ms  p(90)=5.05ms p(95)=6.6ms 
     iterations.....................: 9552   4756.585994/s
     vus............................: 29     min=15        max=29
     vus_max........................: 30     min=30        max=30


running (02.0s), 00/30 VUs, 9552 complete and 0 interrupted iterations
default ✓ [======================================] 00/30 VUs  2s

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./test/load_test/update_banner.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 37s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 7s over 1 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     data_received..................: 422 kB 60 kB/s
     data_sent......................: 1.3 MB 182 kB/s
     http_req_blocked...............: avg=5.06µs  min=1µs    med=3µs     max=1.16ms  p(90)=4µs     p(95)=5µs    
     http_req_connecting............: avg=1.4µs   min=0s     med=0s      max=454µs   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=18.62ms min=4.72ms med=16.56ms max=69.42ms p(90)=31.59ms p(95)=35.66ms
       { expected_response:true }...: avg=18.62ms min=4.72ms med=16.56ms max=69.42ms p(90)=31.59ms p(95)=35.66ms
     http_req_failed................: 0.00%  ✓ 0          ✗ 5620
     http_req_receiving.............: avg=36.09µs min=11µs   med=35µs    max=579µs   p(90)=50µs    p(95)=62µs   
     http_req_sending...............: avg=19.14µs min=7µs    med=18µs    max=348µs   p(90)=25µs    p(95)=29.05µs
     http_req_tls_handshaking.......: avg=0s      min=0s     med=0s      max=0s      p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=18.56ms min=4.67ms med=16.5ms  max=69.36ms p(90)=31.52ms p(95)=35.61ms
     http_reqs......................: 5620   799.911184/s
     iteration_duration.............: avg=18.73ms min=4.82ms med=16.67ms max=69.54ms p(90)=31.71ms p(95)=35.77ms
     iterations.....................: 5620   799.911184/s
     vus............................: 29     min=5        max=29
     vus_max........................: 30     min=30       max=30


running (07.0s), 00/30 VUs, 5620 complete and 0 interrupted iterations
default ✓ [======================================] 00/30 VUs  7s



     data_received..................: 197 kB 98 kB/s
     data_sent......................: 233 kB 116 kB/s
     http_req_blocked...............: avg=9.84µs  min=1µs    med=3µs     max=6.18ms  p(90)=4µs     p(95)=5µs    
     http_req_connecting............: avg=3.4µs   min=0s     med=0s      max=347µs   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=13.78ms min=2.48ms med=11.57ms max=78.21ms p(90)=24.02ms p(95)=28.82ms
       { expected_response:true }...: avg=13.04ms min=2.48ms med=10.83ms max=71.22ms p(90)=23.02ms p(95)=27.49ms
     http_req_failed................: 19.29% ✓ 419         ✗ 1753
     http_req_receiving.............: avg=31.85µs min=9µs    med=29µs    max=661µs   p(90)=50µs    p(95)=59µs   
     http_req_sending...............: avg=15.66µs min=6µs    med=14µs    max=749µs   p(90)=22µs    p(95)=27µs   
     http_req_tls_handshaking.......: avg=0s      min=0s     med=0s      max=0s      p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=13.73ms min=2.44ms med=11.52ms max=78.13ms p(90)=23.98ms p(95)=28.78ms
     http_reqs......................: 2172   1077.304002/s
     iteration_duration.............: avg=13.91ms min=2.57ms med=11.71ms max=78.42ms p(90)=24.13ms p(95)=28.94ms
     iterations.....................: 2172   1077.304002/s
     vus............................: 29     min=15        max=29
     vus_max........................: 30     min=30        max=30


running (02.0s), 00/30 VUs, 2172 complete and 0 interrupted iterations
default ✓ [======================================] 00/30 VUs  2s